sebailfico/sono-loco/esp32-code/src/main.cpp
// Set when entering CLIENT mode failed, so the next attempt is held off.
static unsigned long clientRetryAfterMs = 0;

static void resetRxState() {
    jbuf.reset();
    seqTracker.reset();
    driftCtl.reset(millis());
    jReady       = false;
    rxActive     = false;
    senderLocked = false;
    lastRxMs     = 0;
    rxCount      = 0;
    rxOverflow   = 0;
    rxUnderrun   = 0;
}

static void enterDiscovery() {
    LOG_INFO("=== DISCOVERY ===");

    txReady  = false;
    accumLen = 0;

    const bool wasClient = (currentMode == MODE_CLIENT);
    if (wasClient) deinitI2SForClient();

    // Reset on *every* entry to DISCOVERY, not just when leaving CLIENT.
    // senderLocked used to survive SERVER → DISCOVERY: a node that had once
    // heard server B would then silently ignore every broadcast from server C
    // and could never join the mesh again without a power cycle. rxActive
    // leaking the same way sent the node straight into CLIENT mode on a stream
    // that had stopped minutes earlier.
    resetRxState();

    if (wasClient) {
#ifdef ENABLE_BLUETOOTH
        if (!benchMode) {   // bench mode never starts BT — see the bench section
            delay(100);
            startBluetooth();
        }
#endif
    }

    currentMode = MODE_DISCOVERY;
    LOG_INFO("Free heap: " + String(ESP.getFreeHeap()) + " bytes");
}

static void enterServer() {
    LOG_INFO("=== SERVER — local playback + ESP-NOW broadcast ===");
    // BT is already running (started in setup). Just flip the mode;
    // the data callback will start forwarding once BT audio state goes STARTED.
#ifdef ENABLE_BLUETOOTH
    decimReset();
#endif
    accumLen    = 0;
    currentMode = MODE_SERVER;
}

static void enterClient() {
    LOG_INFO("=== CLIENT — ESP-NOW → I2S ===");

#ifdef ENABLE_BLUETOOTH
    if (!benchMode) {
        LOG_INFO("Stopping BT to release I2S...");
        stopBluetooth();
        delay(200);
    }
#endif

    jbuf.reset();
    seqTracker.reset();
    driftCtl.reset(millis());
    jReady   = false;
    rxActive = false;

    initI2SForClient();
    if (!clientI2SActive) {
        LOG_ERROR("CLIENT I2S unavailable — returning to DISCOVERY");
#ifdef ENABLE_BLUETOOTH
        if (!benchMode) startBluetooth();
#endif
        // Back off before retrying. The server keeps broadcasting, so rxActive
        // is set again within milliseconds; without this the node would retry
        // every loop pass and thrash BT stop/start indefinitely.
        clientRetryAfterMs = millis() + CLIENT_RETRY_BACKOFF_MS;
        currentMode = MODE_DISCOVERY;
        return;
    }

    currentMode = MODE_CLIENT;
    LOG_INFO("Free heap: " + String(ESP.getFreeHeap()) + " bytes");
}

// ============================================================================
// Bench mode — synthetic source, telemetry, serial control
// ============================================================================

static int64_t  benchStartUs      = 0;   // when this node started sourcing
static uint32_t benchPktIdx       = 0;   // packets that should have been sent by now
static uint32_t benchSampleIdx    = 0;   // running sample index, for a continuous tone

/**
 * The test tone, precomputed.
 *
 * Generating it with sinf() per sample put a hard ceiling on how fast a node
 * could source: an ESP32-C3 managed 37.8 packets/s against the 220.5 the stream
 * needs, and starved its client into 159 underruns in 90 s. The C3 has no FPU at
 * all, and `2.0f * M_PI * BENCH_TONE_HZ * t` is worse than it looks — M_PI is a
 * *double*, so the whole expression is evaluated in soft-float double before
 * being handed to sinf. The radio was never the bottleneck: qfull and senderr
 * were both zero throughout.
 *
 * The table holds an exact whole number of tone periods, so playing it end to
 * end and wrapping is seamless — no phase discontinuity, no click. That length
 * is sampleRate / gcd(sampleRate, toneHz): 2205 samples for 440 Hz at 22.05 kHz,
 * which is exactly 44 periods and 4.4 KB.
 *
 * A tone frequency sharing no factor with the sample rate would demand a table
 * of sampleRate samples — 44 KB — hence the static_assert rather than a silent
 * allocation nobody asked for.
 */
static constexpr uint32_t benchGcd(uint32_t a, uint32_t b) {
    return b == 0 ? a : benchGcd(b, a % b);
}
static constexpr uint32_t BENCH_TONE_LEN =
    CLIENT_SAMPLE_RATE / benchGcd(CLIENT_SAMPLE_RATE, BENCH_TONE_HZ);

static_assert(BENCH_TONE_LEN <= 4096,
              "BENCH_TONE_HZ shares too little with CLIENT_SAMPLE_RATE — the "
              "wrap-exact tone table would be huge. Pick a frequency that "
              "divides more evenly (440 Hz at 22050 Hz needs 2205 samples).");

static int16_t  benchTone[BENCH_TONE_LEN];
static uint32_t benchTonePhase = 0;
static bool     benchToneReady = false;

/**
 * Built once when sourcing starts, not at boot: only a source ever needs it, and
 * on a C3 these are the expensive calls that the table exists to keep out of the
 * transmit path.
 */
static void benchBuildTone() {
    for (uint32_t i = 0; i < BENCH_TONE_LEN; i++) {
        const float t = (float)i / (float)CLIENT_SAMPLE_RATE;
        benchTone[i] = (int16_t)(BENCH_TONE_AMPLITUDE *
                                 sinf(2.0f * (float)M_PI * (float)BENCH_TONE_HZ * t));
    }
    benchToneReady = true;
}
static uint32_t benchTxPackets    = 0;   // packets actually queued
static unsigned long benchLastReportMs = 0;

/**
 * Generate the test stream.
 *
 * Paced off `esp_timer_get_time()` rather than millis()/micros(): it is a 64-bit
 * microsecond counter, so it does not wrap at 71 minutes in the middle of a long
 * drift measurement. The due time for each packet is computed from the packet
 * index against the start time, not by adding an interval each pass, so rounding
 * cannot accumulate into exactly the drift we are trying to measure.
 */
static void benchServiceSource() {
    if (!benchSource || !espnowActive || txQueue == nullptr) return;

    const uint32_t samplesPerPkt = ESPNOW_PAYLOAD_SIZE / 2;
    const int64_t  now           = esp_timer_get_time();

